<?php

namespace App\Http\Controllers;

use App\Models\Slider;
use Illuminate\Http\Request;
use Spatie\Permission\Models\Permission;
use Spatie\Permission\Models\Role;

class IndexController extends Controller
{
    public function index()
    {
//        var_dump(time());
//        var_dump(1667113106);
//dd(time() - 1667113106);
        $slider = array(['content' => "من به عنوان پژوهشگر از سامانه clitri استفاده کردم و از پشتیبانی و مشاوران متخصص برای ثبت کارآزمایی بالینی خود بهره بردم .", 'title' => "پژوهشگر"],
            ['content' => "من با استفاده از سامانه clitri طرح خود را ثبت کردم و از امکانات این سامانه استفاده کردم", 'title' => "پژوهشگر"],

            ['content' => "من به عنوان پژوهشگر از سامانه clitri استفاده کردم و از پشتیبانی و مشاوران متخصص برای ثبت کارآزمایی بالینی خود بهره بردم .", 'title' => "پژوهشگر"],

        );

        $blogs = array(['img' => "blog_post1.jpg", 'title' => "مرکز فناوری پزشکی
نوآوری", 'link' => "#", 'content' => "ورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ", 'text' => "ادامه مطلب"],
            ['img' => "blog_post2.jpg", 'title' => "بیمارستانی که برای مراقبت از آنها
اعتماد
دارید
تو دوست داری", 'link' => "#", 'content' => "ورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ", 'text' => "ادامه مطلب"],
            ['img' => "blog_post3.jpg", 'title' => "مرکز فناوری پزشکی
نوآوری", 'link' => "#", 'content' => "ورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ", 'text' => "ادامه مطلب"],
            ['img' => "blog_post1.jpg", 'title' => "جایی که شفا هست امید هست", 'link' => "#", 'content' => "ورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ", 'text' => "ادامه مطلب"],
            ['img' => "blog_post2.jpg", 'title' => "مرکز فناوری پزشکی
نوآوری", 'link' => "#", 'content' => "ورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ", 'text' => "ادامه مطلب"],
            ['img' => "blog_post3.jpg", 'title' => " بیمارستانی که برای مراقبت از آنها
اعتماد
دارید
تو دوست داری", 'link' => "#", 'content' => "ورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ", 'text' => "ادامه مطلب"],
            ['img' => "blog_post1.jpg", 'title' => "جایی که شفا هست امید هست", 'link' => "#", 'content' => "ورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ", 'text' => "ادامه مطلب"],
        );


        $medicals = array(['img' => "general.png", 'title' => "خدمات پزشکی ما", 'link' => "#", 'content' => "این موارد کاملا ساده و آسان برای تشخیص یک ساعت رایگان زمانی که قدرت ما است"],
            ['img' => "laboratory.png", 'title' => "خدمات پزشکی ما", 'link' => "#", 'content' => "این موارد کاملا ساده و آسان برای تشخیص یک ساعت رایگان زمانی که قدرت ما است"],
            ['img' => "symptom.png", 'title' => "خدمات پزشکی ما", 'link' => "#", 'content' => "این موارد کاملا ساده و آسان برای تشخیص یک ساعت رایگان زمانی که قدرت ما است"],
            ['img' => "emergency.png", 'title' => "خدمات پزشکی ما", 'link' => "#", 'content' => "این موارد کاملا ساده و آسان برای تشخیص یک ساعت رایگان زمانی که قدرت ما است"],
            ['img' => "medical.png", 'title' => "خدمات پزشکی ما", 'link' => "#", 'content' => "این موارد کاملا ساده و آسان برای تشخیص یک ساعت رایگان زمانی که قدرت ما است"],
            ['img' => "cardio.png", 'title' => "خدمات پزشکی ما", 'link' => "#", 'content' => "این موارد کاملا ساده و آسان برای تشخیص یک ساعت رایگان زمانی که قدرت ما است"],
        );


        $banners = array(['icon' => "icons8-easy-100.png", 'title' => "استفاده آسان", 'content' => "رابط کاربری سامانه به گونه ای طراحی شده است که ساده و کاربر پسند باشد. آموزش ویدیویی آنلاین، و خدمات سریع به مشتریان، تنظیم مطالعه شما را بسیار ساده می کند."],
            ['icon' => "icons8-analyze-100.png", 'title' => "تحلیل و آنالیز", 'content' => "محققان این امکان را می‌دهد تا قبل از جمع‌آوری داده‌ها، وابستگی‌ها بین متغیرها/سوالات و اعتبارسنجی‌های لازم را به فرم‌های تحقیق اضافه کنند و کیفیت داده‌ها را به طور قابل‌توجهی بهبود ببخشند."],
            ['icon' => "icons8-click-100.png", 'title' => "دسترسی و نگهداری", 'content' => " Clitri  به محققان و همکارانشان اجازه می دهد که بتوانند مجموعه داده ها را ترکیب و به راحتی از داده ها برای تجزیه و تحلیل فرضیه های کاملاً جدید، و یا متاآنالیز استفاده کنند."],
        );

        $sliders = Slider::all();
        $images = array(['link' => '#', 'img' => '2.png'], ['link' => '#', 'img' => '3.png'], ['link' => '#', 'img' => '4.png'],
            ['link' => '#', 'img' => '5.png'], ['link' => '#', 'img' => '1.png'], ['link' => '#', 'img' => '6.png'],);
        return view('index', compact('slider', 'blogs', 'medicals', 'banners', 'sliders', 'images'));

    }
}
